backend/app/controllers/transactions_controller.rb

  def index
    transactions = Transaction.all
---
SELECT "transactions".* FROM "transactions"

  def create
    transaction = Transaction.new(transaction_params)
    if transaction.save
---
INSERT INTO "transactions" ("title", "amount", "gen_ledger_account", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"