backend/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Lucas baby"], ["created_at", "2022-10-25 03:46:59.861741"], ["updated_at", "2022-10-25 03:46:59.861741"]]